         01 CHECK-POINT-FILE.
            05 CHKPT-PARTITION    PIC S9(9) BINARY.
            05 CHKPT-OFFSET       PIC S9(18) BINARY.
            05 FILLER             PIC X(2037).